{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "trainable": true, "activation": "linear", "nb_col": 3, "batch_input_shape": [null, 32, 64, 3], "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "valid", "bias": true, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "name": "convolution2d_1", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "valid", "bias": true, "dim_ordering": "tf", "nb_filter": 36, "name": "convolution2d_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "bias": true, "dim_ordering": "tf", "nb_filter": 48, "name": "convolution2d_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "trainable": true, "activation": "linear", "batch_input_shape": [null, 5376], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "b_constraint": null, "input_dim": 5376, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "trainable": true, "activation": "linear", "batch_input_shape": [null, 100], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "b_constraint": null, "input_dim": 100, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "trainable": true, "activation": "linear", "batch_input_shape": [null, 10], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "bias": true, "b_constraint": null, "input_dim": 10, "output_dim": 1, "activity_regularizer": null}}], "keras_version": "1.2.0"}